[FileInfo]
TranslatorName=GVG, www.gvg.cz
LanguageName=Čeština
TargetVersion=0.4.13.66
[General]
1001=Šipka
1002=Štětec
1003=Guma
1004=Klonování
1005=Náhrada barvy
1006=Text
1007=Čára
1008=Čára s šipkou
1009=Elipsa
1010=Obdélník
1011=Vyplnění
1012=Kapátko
1013=Otočení
1014=Měření
1015=Nastavení tužky a štětce
1016=Nápověda
1017=O pluginu...
2001=Nástroj Výběr je použit pro normální používání programu IrfanView (např. pro vytváření výřezu obrázku).
2002=Nástroj Štětec je použit pro kreslení rukou.\nKlepněte a táhněte levým tlačítkem myši pro kreslení s barvou popředí.\nKlepněte a táhněte pravým tlačítkem myši pro kreslení s barvou pozadí.
2003=Nástroj Guma je použit pro vymazání nakresleného objektu.\nKlepněte a táhněte levým tlačítkem myši pro vymazání barvou pozadí.\nKlepněte a táhněte levým tlačítkem myši pro obnovení vymazaného místa.
2004=Nástroj Klonování zkopíruje část obrázku do jiné oblasti.\nMůže být použit pro odebrání prachu a škrábanců z fotografií.\nKlepněte pravým tlačítkem pro výběr zdroje a pak klepněte levým tlačítkem tam, kde chcete mít zkopírovanou část.
2005=Nástroj Náhrada barvy je použit pro náhradu barvy jinou.\nKlepněte a táhněte levým tlačítkem myši pro nahrazení barvy pozadí barvou popředí.\nKlepněte a táhněte pravým tlačítkem myši pro nahrazení barvy popředí barvou pozadí.
2006=Nástroj Text přidá formátovaný text do obrázku.\nVložený text bude umístěn na pozici kurzoru.\nText bude zarovnán vlevo, vpravo nebo uprostřed od kurzoru.
2007=Nástroj Čára kreslí přímé čáry.\nKlepněte a táhněte pro definování čáry. Pro nakreslení čáry uvolněte tlačítko myši.\nPro zrušení čáry klepněte pravým tlačítkem myši.\nV průběhu přetahování držte klávesu CTRL pro vycentrování čáry od počátečního bodu.\nV průběhu přetahování držte klávesu SHIFT pro naklápění čar po 45°.
2008=Nástroj Čára s šipkou kreslí šipky.\nKlepněte a táhněte pro definování šipky. Pro nakreslení šipky uvolněte tlačítko myši.\nPro zrušení šipky klepněte pravým tlačítkem myši.\nV průběhu přetahování držte klávesu CTRL pro vycentrování šipky od počátečního bodu.\nV průběhu přetahování držte klávesu SHIFT pro naklápění šipky po 45°.\nKlepněte pravým tlačítkem myši na tomto tlačítko pro otevření dialogu "Nastavení šipky".
2009=Nástroj Elipsa kreslí kruhy a elipsy. Pokud je volba "Vyplnit" zaškrtnuta, pak budou tvary vyplněny barvou; pokud ne, budou barevné pouze okraje.\nKlepněte a táhněte pro definici elipsy. Pro nakreslení elipsy uvolněte tlačítko myši.\nPro zrušení elipsy klepněte pravým tlačítkem myši.\nV průběhu přetahování držte klávesu CTRL pro vycentrování elipsy od prostředka.\nV průběhu přetahování držte klávesu SHIFT pro nakreslení kruhu.
2010=Nástroj Obdélník kreslí obdélníky a čtverce. Pokud je volba "Vyplnit" zaškrtnuta, pak budou tvary vyplněny barvou; pokud ne, budou barevné pouze okraje.\nKlepněte a táhněte pro definici obdélníku/čtverce. Pro nakreslení obdélníku/čtverce uvolněte tlačítko myši.\nPro zrušení obdélníku/čtverce klepněte pravým tlačítkem myši.\nV průběhu přetahování držte klávesu CTRL pro vycentrování obdélníku/čtverce od prostředka.\nV průběhu přetahování držte klávesu SHIFT pro nakreslení čtverce.
2011=Nástroj Vyplnění je použit pro vyplnění oblasti jednou barvou.\nKlepněte levým tlačítkem myši pro vyplnění oblasti barvou popředí.\nKlepněte levým tlačítkem myši pro vyplnění oblasti barvou pozadí.
2012=Nástroj Kapátko je použit pro výběr barvy z obrázku.\nPro sejmutí barvy popředí na ní klepněte levým tlačítkem myši.\nPro sejmutí barvy pozadí na ní klepněte pravým tlačítkem myši.\nKlepněte na tomto tlačítku se současným držením klávesy SHIFT pro zakázání automatického návratu k předchozímu nástroji.
2013=Nástroj Otočení je použit pro otočení obrázku.\nKlepněte a táhněte pro vytvoření čáry, podle které bude obrázek natočen.\nPro zrušení čáry klepněte pravým tlačítkem myši.\nV průběhu přetahování držte klávesu CTRL pro vycentrování čáry od počátečního bodu.\nV průběhu přetahování držte klávesu SHIFT pro naklápění čar po 45°.
2014=Nástrojem Měření můžete měřit vzdálenosti a úhly na obrázku.\nKlepněte a táhněte pro výběr vzdálenosti pro měření.\nVšechna měření úhlů jsou relativní k horizontální čáře.\nPro zrušení čáry klepněte pravým tlačítkem myši.\nV průběhu přetahování držte klávesu CTRL pro vycentrování čáry od počátečního bodu.\nV průběhu přetahování držte klávesu SHIFT pro naklápění čar po 45°.\nKlepněte pravým tlačítkem myši na tomot tlačítku pro otevření dialogu "Jednotky měření", ve kterém můžete definovat nové jednotky měření a upravovat, mazat nebo třídit současné.
2015=Zobrazí nastavení tužky a štětce
2016=Zobrazí nápovědu
2017=Zobrazí informace o IrfanPaint
5000=Chyba
5201=Před použitím nástroje Klonování musíte nastavit bod zdroje.\nV nápovědě lze získat více informací.
5102=Nelze uložit nastavení; zkontrolujte, zda lze zapisovat do souboru i_view32.ini.
6001=Speciální poděkování:\r\n\r\nIrfan Skiljan, autor programu IrfanView, který strávil mnoho času na integraci tohoto pluginu, předal mi mnoho důležitých rad a byl vždy velmi vstřícný.\r\n\r\nUživatelům fóra podpory programu IrfanView a především:\r\nBhikkhu Pesala, za napsání nápovědy a tipů u nástrojů, za nahlášené chyby a za pomoc s jejich odstraňováním.\r\nMatera, který, ač z opačného místa na Zemi, mi umožnil se vzdáleně připojit k jeho počítači a vysledovat tak chyby a opravit je.\r\nSteve, administrátor fóra.\r\n\r\nVšem betatesterům, speciálně však Leonovi Fiskovi, který hlásil všechny chyby IrfanPaint na Windows NT 4.\r\n\r\nDavide Pizzolato a jeho skvělá knihovna CxImage (http://www.codeproject.com/KB/graphics/cximage.aspx), ze které jsem ukořistil pár řádků kódu.\r\n\r\nLode Vandevenne za jeho pomoc s implementací algoritmu pro vyplňování (http://student.kuleuven.be/~m0216922/CG/floodfill.html).\r\n\r\nCodeProject.com a všechny skvělé tipy zde, které mi mnohokrát pomohly.\r\n\r\nVšem překladatelům.\r\n\r\nVšem uživatelům, kteří přispěli na vývoj - DÍKY!
1443=Popředí
1444=Pozadí
5301="%what%" není správné číslo.
5302=Pole nemohou být prázdná.
1101=%language% - překlad %translator%
1651=Jméno
1652=Symbol
1653=Definice
1654=Opravdu chcete smazat současně vybranou jednotku měření?
1655=Potvrdit smazání
7001=výchozí jednotka
7002=n.d.
7003=DPI nenastaveno
7011=palec
7012=bod
7013=stupeň
7014=millimetr
5000=Chyba
[101]
0=O pluginu IrfanPaint
1=OK
1102=Text
1104=&Web IrfanPaint
[100]
0=Kresl.
1060=Panel nástrojů IrfanPaint
1053=Šířka:
1059=Vyplnit
1056=Tolerance:
[103]
0=Nastavení šipky
1=OK
2=Storno
1301=&První šipka
1311=Nakreslit:
1302=&Druhá šipka
1309=Šířka šipky:
1310=Délka šipky:
1308=Otevřená
[102]
0=Výběr barvy
1=OK
2=Storno
[104]
0=Nastavení tužky a štětce
1442=Tužka
1441=Štětec
1=OK
2=Storno
1432=Styl:
1404=_______
1405=_ _ _ _ _
1406=. . . . . .
1407=_ . _ . _ .
1408=_ . . _ . .
1433=Konec:
1410=Zakulac.
1411=Obdélníky
1412=Ploché
1434=Spojení čar:
1413=Kulaté
1414=Zkosené
1415=Spojené
1416=Pevné
1417=- (horizontální)
1418=|| (vertikální)
1419=\\\\ (šikmé zleva)
1420=//  (šikmé zprava)
1421=+ (kolmé)
1422=x (úhlopříčně)
1435=Plný
1437=Šrafování 45° zleva vpravo
1438=Šrafování křížem
1436=Šrafování čárami
1439=Barva
1445=Šířka tužky
1448=bodů (1-9999)
1440=Druhá barva šrafování
1426=Průhledná
1429=Mezera 1 bod\r\nTečka 1 spoj.
1431=Klepněte na panelu výše pro změnu stylů popředí a pozadí.
[105]
0=Vložit text
1501=&Písmo:
1502=&Velikost:
1506=Tučně
1507=Kurzíva
1508=Podtržené
1509=Přeškrtnuté
1510=Zarovnat vlevo
1511=Zarovnat doprostřed
1512=Zarovnat vpravo
1=OK
2=Storno
1526=&Držte stisknuté pro náhled
1513=Barva
1521=Renderovat jako
1522=Prázdná cesta
1524=Text
1523=Vyplněná cesta
1525=Text Antialias
[106]
0=Jednotky měření
1602=&Zavřít
1603=&Nahoru
1604=&Dolů
1605=&Absolutní
1606=&Přidat...
1607=&Upravit...
1608=&Odebrat
[107]
0=Upravit jednotku měření
1701=Jméno:
1703=Symbol:
1705=Definice:
1706=1 %unitsymbol% =
1=OK
2=Storno
[108]
0=Výsledky měření
1=OK
1803=&Nová...
1802=&Kopírovat
﻿
